{
    "fach": {
        "wirtschaft": {
            "thema": {
                "aufgabenbr": {
                    "fragen": [
                        "Schutzaufgaben",
                        "Gestaltungsaufgaben",
                        "Förderungsaufgaben",
                        "Überwachungsaufgaben"
                    ],
                    "antworten": [
                        "Unterstützung der Eingliederung schwerbehinderter Arbeitnehmer und sonstiger schutzbedürftiger Personen. Dürchsetzung von Maßnahmen für ältere Arbeitnehmer.Förderung der Integration ausländischer Arbeitnehmer.",
                        "Entgegennahme von Anregungen von Arbeitnehmern und Mitgliedern der JAV (Jugend- und Auszubildendenvertretung). Beantragung und Durchsetzung von Maßnahmen beim Arbeitgeber.",
                        "Dürchsetzung der tatsächlichen Gleichstellung von Männern und Frauen. Förderung der Vereinbarkeit von Familie und Erwerbstätigkeit.Vorbereitung und Dürchführung der Wahl der JAV (Jugend- und Auszubildendenvertretung).Förderung und Sicherung der Beschäftigung im Betrieb.",
                        "Überwachung der Dürchführung der zugunsten der Arbeitnehmer geltenden Gesetze, Verordnungen, Unfallverhütungsvorschriften und Betriebsvereinbarungen."
                    ]
                },
                "güterarten": {
                    "fragen": [
                        "Freie Güter",
                        "Konsumgüter",
                        "Produktionsgüter",
                        "Wirtschaftsgüter",
                        "Unterschied Produktionsgüter und Konsumgüter"
                    ],
                    "antworten": [
                        "Freie Güter sind im Überfluss vorhanden und kosten deshalb grundsätzlich kein Geld (z. B. Luft, Meersand).",
                        "Finden in Haushalten Verwendung als Verbrauchsgüter (z.B. Milch) oder als Gebrauchsgüter (z.B. Waschmaschine)",
                        "Finden in Betrieben Verwendung als Verbrauchsgüter (z.B. Spanplatten) oder als Gebrauchsgüter (z.B. eine Bandsäge).",
                        "Wirtschaftsgüter sind alle Güter die die materiellen Bedürfnisse der Menschen befriedigen und werden durch ihre Knappheit definiert. Daher müssen die Menschen mit diesen Gütern wirtschaften weil Sie nicht unbegrenzt verfügbar sind wie Sonne und Luft.",
                        "Beide Güterarten können als Gebrauchs- und Verbrauchsgüter dienen wie z.B. eine Waschmaschine oder eine Bandsäge. Der wesentliche Unterschied besteht darin dass Konsumgüter in Haushalten Verwendung finden und Produktionsgüter in Betrieben."
                    ]
                },
                "wirtschaftsstufen": {
                    "fragen": [
                        "primärer Wirtschaftssektor",
                        "sekundärer Wirtschaftssektor",
                        "tertiärer Wirtschaftssektor"
                    ],
                    "antworten": [
                        "Der Primärsektor beinhaltet die Gewinnung von Rohstoffen, er ist der älteste Sektor und wird auch Urproduktion genannt. Zu ihm gehören die Landwirtschaft, die Forstwirtschaft sowie die Fischerei.",
                        "Im sekundären Sektor werden die Rohstoffe des Primärsektor ver- bzw. bearbeitet. Die Weiterverarbeitung erfolgt durch die Industrie, das Handwerk, das Baugewerbe, die Energiewirtschaft und die Wasserversorgung.",
                        "Der Tertiärsektor beschäftigt sich ausschließlich mit Dienstleistungen. Deswegen wird er auch der Dienstleistungssektor genannt. Dienstleistungsbranchen sind zum Beispiel Kliniken, Banken und der Tourismus"
                    ]
                },
                "ausbgesetze": {
                    "fragen": [
                        "Ausbildungsordnung",
                        "Jugendarbeitschutzgesetz",
                        "Arbeitszeitgesetz",
                        "Berufsbildungsgesetz",
                        "Entgeltfortzahlungsgesetz"
                    ],
                    "antworten": [
                        "Beinhaltet die Bezeichnung des Ausbildungsberufes, der anerkannt wird. Legt die Ausbildungsdauer fest, die nicht mehr als drei und nicht weniger als zwei Jahre betragen soll. Beinhaltet den Ausbildungsrahmenplan, der dem Ausbilder sowie Auszubildenden als Vorgabe für den betrieblichen Ausbildungsplan dient. Beinhaltet den Rahmenlehrplan, der die angestrebten Kompetenzen sowie Unterrichtsinhalte für den berufsbezogenen Unterricht der Berufsschule beschreibt. Beinhaltet eine Prüfungsordnung, in der die Zulassung zur Prüfung und Gliederung der Prüfung sowie das Bewerten der Prüfungsleistungen geregelt sind.",
                        "Alles Wichtige finden minderjährige Auszubildende im Jugendarbeitschutzgesetz. Man darf z.B. als Minderjähriger nicht so viel arbeiten wie Volljährige und man hat mehr Anspruch auf Urlaub. Erst wenn man volljährig ist, wird das BBiG (Berufsbildungsgesetz) relevant.",
                        "Für volljährige Auszubildende regelt das Arbeitszeitgesetz die Arbeitszeit.",
                        "Das BBiG gibt Regelungen für die duale Ausbildung vor.Hier sind die Pflichten von Auszubildenden und Ausbilder definiert, genauso wie die Grundlagen für den Ausbildungsvertrag z.B. im §11 BBiG die Vertragsniederschrift. Auch die Vergütung, Beginn und Beendigung eines Ausbildungsverhältnisses regelt das BBiG.",
                        "Es wird auch EntgFG genannt und regelt das Gehalt, wenn man krank ist. Es ist auch wichtig für die Auszubildenden, weil es auch vorschreibt wie und wann man während der Ausbildung sich im Krankheitsfall melden muss."
                    ]
                },
                "marktpreis": {
                    "fragen": [
                        "Angebotsmenge und Preis",
                        "Nachfragemenge und Preis",
                        "Der Preis im Verhältnis zu Angebots- und Nachfragemenge",
                        "Verhältnis von Angebotsmenge, Nachfragemenge und Preis",
                        "Gleichgewichtspreis",
                        "Die verkaufte Menge (Umsatz)",
                        "Beschreibung der Marktlage"
                    ],
                    "antworten": [
                        "Die Angebotsmenge ist umso größer, je 'größer' der Stückpreis ist. Die Anbieter wollen also zu möglichst 'hohen' Preisen verkaufen.",
                        "Die Nachfragemenge ist umso größer, je 'kleiner' der Stückpreis ist. Die Nachfrager wollen also zu möglichst 'kleinen' Preisen kaufen.",
                        "Ist der Stückpreis niedrig, so ist die angebotene Menge 'niedrig', die nachgefragte Menge hingegen hoch. Umgekehrt gilt: ist der Stückpreis hoch, so ist die angebotene Menge 'hoch', die nachgefragte Menge 'niedrig'.",
                        "Die angebotene Menge steht also in einem geraden 'proportionalen' Verhältnis zum Preis. Die nachgefragte Menge in einem 'antiproportionalen' Verhältnis zum Preis.",
                        "Bei einem bestimmten Preis sind Angebots- und Nachfragemenge identisch. Bei diesem Preis sind Angebot und Nachfrage im Gleichgewicht; deshalb nennt man ihn den 'Gleichgewichtspreis'.Kennzeichen dieses Preises: Die verkaufte Menge ist bei diesem Preis am 'höchsten'. Es gibt weder einen Angebots- noch einen 'Nachfrageüberschuss'.",
                        "Sie verhält sich bei steigenden Preisen wie folgt: zuerst 'steigt' sie bis zum Gleichgewichtspreis, danach 'sinkt' sie.",
                        "Bei niedrigen Preisen ist die Angebotsmenge 'geringer' als die Nachfragemenge, d.h. es besteht ein 'Nachfrageüberschuss'. Bei relativ hohen Preisen ist die Angebotsmenge 'höher' als die Nachfragemenge, d.h. es besteht ein 'Angebotsüberschuss "
                    ]
                },
                "produktionsfaktoren": {
                    "fragen": [
                        "Produktionsfaktor Arbeit",
                        "Ausführende Arbeit",
                        "Leitende Arbeit",
                        "Produktionsfaktor Boden",
                        "Produktionsfaktor Kapital"
                    ],
                    "antworten": [
                        "Wird definiert als jede legale menschliche Tätigkeit, die auf die Erzielung von Einkommen gerichtet ist. Man unterscheidet zwischen der ausführend (exekutiven) und der leitenden (dispositiver) Arbeit.",
                        "Die ausführende Arbeit umfasst Tätigkeiten, die i.d.R. weisungsabhängig sind und der unmittelbaren Bewältigung der täglichen Routinearbeiten dienen. Zum Beispiel gehört zur ausführenden Arbeit eines Kellners das Tischdecken, die Beratung und Bedienung der Gäste, das Abräumen des Tisches usw.",
                        "Die leitende Arbeit dient der Planung, Organisation und Kontrolle des Produktionsablaufes und wird von leitenden Angestellten oder Firmeninhabern geleistet. So gehört beispielsweise zur leitenden Arbeit eines Supermarktes das Einteilen des Personalbedarfs, evtl. die Einstellung und Kündigung von Verkaufskräften, usw.",
                        "Der Produktionsfaktor Boden lässt sich in drei Kategorien untergliedern: Anbauboden -Zur Erzeugung wird er in der Land-, Forst- und Fischereiwirtschaft genutzt. Abbauboden - Wenn unersetzbare Stoffe abgebaut oder gefördert werden (Erze, Öl...). Standortboden -dient als Standort für Unternehmen aus Industrie, Handwerk und Handel.",
                        "Das ist der Einsatz von Werkzeugen, Maschinen und anderen Produktionsmitteln."
                    ]
                },
                "ökoprinzip": {
                    "fragen": [
                        "Ökonomische Prinzip",
                        "Knappheit",
                        "Maximalprinzip",
                        "Minimalprinzip"
                    ],
                    "antworten": [
                        "Das ökonomische Prinzip geht von folgenden Annahme aus: Die menschlichen Bedürfnisse sind unbegrenzt. Gleichzeitig stehen Mittel und Güter nicht in so ausreichendem Maße zur Verfügung, dass damit alle Bedürfnisse befriedigt werden könnten. Diesen Zustand bezeichnet man auch als Knappheit.",
                        "Die Knappheit der Güter führt dazu, dass Menschen wirtschaften müssen. Das bedeutet: Sie müssen planvoll vorgehen, um die zur Verfügung stehenden Mittel und Güter bestmöglich zu nutzen. Dabei werden zwei Vorgehensweisen unterschieden: das Maximalprinzip und das Minimalprinzip.",
                        "Wer nach dem Maximalprinzip handelt, der möchte mit gegebenen Mitteln einen größtmöglichen Erfolg erzielen. Beilspielsweise bemüht sich ein Unternehmen, mit einer gegebenen betrieblichen Ausstattung an Maschinen, Personal und Rohstoffen, eine möglichst große Produktionsmenge zu erhalten. Dieses Prinzip wird aus Haushaltsprinzip genannt.",
                        "Wer nach dem Minimalprinzip handelt, der möchte ein bestimmtes Ziel mit einem möglichst geringen Mitteleinsatz erreichen. Beispielsweise versucht ein Unternehmen, eine festgelegte Materialmenge zu möglichst geringen Kosten einzukaufen. Dieses Prinzip nennt man auch Sparprinzip."
                    ]
                }
            }
        },
        "testfach": {
            "thema": {
                "testthema": {
                    "fragen": [
                        "testfrage"
                    ],
                    "antworten": [
                        "testantwort"
                    ]
                }
            }
        },
        "Informatik": {
            "thema": {
                "Wireless LAN": {
                    "fragen": [
                        "Was bedeutet der Begriff Infrastruktur-Modus?",
                        "Erläutern Sie drei mögliche Gründe warum die Datentransferrate eines WLAN-Access-Point nicht den angegebenen Werten entsprechen kann.",
                        "Erklären Sie die Funktionsweise von Power over Ethernet (PoE) im Mode A",
                        "Welche Aufgaben übernimmt der authenticator in einem WLAN-Netzwerk?",
                        "Was versteht man unter einem WLAN Ad-hoc Netzwerk?",
                        "Was bedeutet Intra-cell Repeating?",
                        "Was bedeutet Walled Garden?",
                        "Was ist unter credentials zu verstehen?",
                        "Erläutern Sie das Verfahren CSMA/CA.",
                        "Aus welchen Gründen wird CSMA/CD nicht verwendet?"
                    ],
                    "antworten": [
                        "Als Infrastruktur-Modus bezeichnet man den Netzwerkbetrieb eines Wireless LAN mithilfe eines Access Points. Dies kannein WLAN-Router, Switch oder ein reiner AP sein der alle WLAN-Clients zu einem drahtlosen Netzwerk zusammenfasst und damit sämtliche Netzwerkfunktionen zur Verfügung stellt.",
                        "Die Datentransferrate hängt zum einem von den Zugriffsverfahren ab wie alle Clients im WLAN-Netzwerk die Sendeberechtigungen aushandeln. Ein weiterer wichtiger Grund ist die Distanz zwischen Client und Access Point sowie Wände und Decken. Störungen von fremden Funksystemen können sich auch negativ auf die Modulation des Funksignals auswirken und somit sinkt auch die Datentransferrate.",
                        "Beim PoE im Mode A findet eine Phantom-Speisung auch Fernspeisung genannt statt. Das bedeutet dass Strom auf den Datenführenden Adernpaaren übertragen wird. Auf Pin 1 und 2 erhalten die Geräte Daten und durch Phantomspeisung übertragene positive Spannung. Die Übertragung von Daten und negativer Spannung findet auf den Pins 3 und 6 statt.",
                        "Der authenticator kann ein WLAN-Access-Point oder eine switch sein und agiert als eine Art Wächter wenn ein Client-Gerät eine Verbindung herstellen möchte. Der authenticator leitet die Anmeldeinformationen des Clients an den authentication server weiter, der dann über die Gültigkeit der aten entscheidet.",
                        "Im Ad-Hoc Modus wird kein AP benötigt. Zwei Endgeräte können eine Verbindung aufbauen und Daten austauschen. Bei der Einrichtung sind keine weiteren aktiven Elemente erforderlich. Die Hosts kommunizieren direkt über ihre WLAN-Adapter. Solange sich die Hosts gegenseitig in Reichweite befinden, ist eine Kommunikation zwischen den Hosts möglich.",
                        "Damit kann man einstellen ob die Kommunikation zwischen den per WLAN verbundenen Benutzern innerhalb einer Funkzelle erlaubt sein soll.",
                        "Es ist eine geschlossene Platform auf der Restriktionen vom Betreiber festgellegt sind, auf den der Benutzer nur zugelassene Anwendungen benutzen kann oder nur bestimmte Websites besuchen darf.",
                        "Unter credentials in einem WLAN-Netzwerk versteht man Benutzernamen, Passwörter oder digitale Zertifikate die zur Authentikation der Clients dienen.",
                        "CSMA/CA steht für Carrier Sense Multiple Access/Collision Avoidance. Bei dem Verfahren nimmt der zentrale AP Anfragen an und erteilt einem der Geräte den Zugriff auf den Übertragungskanal. Dieses Verfahren wird eingesetzt wenn ein Endgerät mit einem zentralen AP verbunden ist aber ein anderes Endgerät detektieren muss das auf der gegenüberliegenden Ende der maximalen Reichweite des AP befindet.",
                        "Bei langen Leitungen, sehr vielen Stationen (wenn sie über 30 % der Bandbreite des Ethernetzes ausnutzen), vielen Repeatern (Signalaufbereiter und Verstärker) entstehen unterschiedliche Signallaufzeiten die zu häufigen Kollisionen der Funksignalen führen. Hier wird das CSMA/CD (Carrier Sense Multiple Access with Collision Detection) nicht verwendet."
                    ]
                },
                "Netzwerkprotokolle": {
                    "fragen": [
                        "Was ist ein Netzwerk?",
                        "Was ist ein Protokoll?",
                        "Was ist ein Server?",
                        "Was ist ein Client?",
                        "Wofür steht die Abkürzung HTTP?",
                        "Wie heißt die oberste Ebene der Netzwerkkommunikation?",
                        "Wie heißt die zweite Ebene der Netzwerkkommunikation?",
                        "Wofür steht SYN und SYNACK? Wozu wird es genutzt im TCP?",
                        "Was passiert wenn eine Datei zu groß ist um sie als Paket zu verschicken?",
                        "Wofür werden die Datenpakete nummeriert?",
                        "Wofür steht UDP, wofür wird es genutzt und warum?",
                        "Wie heißt die dritte Schicht der Netzwerkkommunikation und wie heißt das genutzte Protokoll?",
                        "Was ist eine IP und woraus besteht sie?",
                        "Was bedeutet :: in der IP Adresse?",
                        "Was ist eine Subnetzmaske und was sagt sie aus?",
                        "Was ist IPv4 und welche Form hat es?",
                        "Wofür steht DNS und was beinhaltet sie?",
                        "Was ist eine Link Local IMAC Adresse?",
                        "Wofür steht NDP und welche Übertragungsmöglichkeiten gibt es?",
                        "Wie heißt die vierte Kommunikationsschicht und wie heißt die genutzte Spezifikation?",
                        "Was ist ein Switch und was ist der Unterschied zu einem Hub?"
                    ],
                    "antworten": [
                        "Das ist die Verbindung von mindestens zwei Computersystemen, entweder per Kabel oder drahtlos",
                        "In der Informatik und in der Telekommunikation ist ein Protokoll eine Menge von Regeln, die Syntax, Semantik und Synchronisation der Kommunikation bestimmt. Handelt es sich um die Kommunikation in einem Rechnernetz, so spricht man von einem Netzwerkprotokoll.",
                        "Es gibt zwei unterschiedliche Arten von Server: Ein Hardware Server bezeichnet einen Computer der seine Resourcen über ein Netzwerk zur Verfügung stellt. Auf ihm laufen neben dem Betriebssystem ein oder mehrere softwarebasierte Server. Oftmals wird ein hardwarebasierter Server auch Host genannt. Softwarebasierte Server: Ein softwarebasierter Server ist ein Programm, das einen speziellen Dienst anbietet. Dieser Dienst wird von anderen Programmen -auch Clienst genannt- lokal oder über ein Netzwerk in Anspruch genommen.",
                        "Bei einem CLient handelt es sich entweder um ein Computer bzw. Endgerät, das selbst Dienste von einem Server abruft. Oder es ist eine clientseitige Anwendung oder Clientprogramm, das auf dem Endgerät eines Netzwerks ausgeführt wird und mit einem Server (Zentralrechner) kommuniziert.",
                        "Http steht für Hypertext Transfer Protocol. Es ist ein zustandsloses Protokoll und dient der Übertragung von Daten auf der Anwendungsschicht über ein Rechnernetz.",
                        "Sie heißt Anwendungsschicht und ist nach dem OSI-Referenzmodell die oberste Ebene der NEtzwerkkommunikation. Die Anwendungsschicht führt Dienste für die Anwendung aus, die vom Endbenutzer verwendet werden.",
                        "Nach dem OSI-Referenzmodell ist das die Sicherungsschicht. Sie erstellt und adressiert Frames für die Host-zu-Host Übertragung in lokalen Netzwerken (LANs) mithilfe von Netzzugangsgeräten.",
                        "Es ist der Verbindungsaufbau in der TCP-Kommunikation. Der Verbindungsaufbau läuft nach dem Three-Way-Handshake ab. Zuerst schickt der Client an den Server einen Verbindungswunsch (SYN). Der Server bestätigt den Erhalt der Nachricht (ACK) und äußert ebenfalls seinen Verbindungswunsch (SYN). Danach erfolgt der Datenaustausch zwischen Client und Server.",
                        "Die TCP-Software des Senders teilt die Daten auf mehrere Pakete auf, fügt einen TCP-Header zu jedem Paket hinzu und versendet die TCP-Segmente. Dieser Vorgang wird Segmentierung genannt. Die TCP-Segmente werden nacheinander abgeschickt.",
                        "Bei der Versendung der TCP-Segmente bzw Datenpakete kommen diese beim Empfänger nicht notwendigerweise in derselben Reihenfolge an wie sie versendet wurden, da im Internet unter Umständen jedes TCP-Segment einen anderen Weg nimmt. Damit die TCP-Software beim Empfänger die Datenpakete wieder sortieren kann, ist jedes Segment nummeriert.",
                        "UDP ist ein minimales, verbindungsloses Netzwerkprotokoll, das zur Transportschicht gehört, nach dem OSI-Referenzmodell. UDP steht für User Datagram Protocol. UDP ermöglicht Anwendungen den Versand von Datagrammen. Das sind in sich geschlossene, unabhängige Dateneinheiten, die ohne weitere Verbindungssicherung zwischen zwei Endgeräten verschickt werden können. Dieses Verfahren ist konzeptionell sehr einfach und zeichnet sich vor allem durch seinen geringen Protokoll-Overhead aus, sprich nur die Empfänger- und Absenderadressen  sowie die Nutzdaten sind enthalten. UDP ist ein nicht-zuverlässiges, ungesichertes Übertragungsprotokoll das aber sehr schnell ist. UDP wird häufig bei Servern eingesetzt, die viele Clients bedienen, Multimediaanwendungen oder Mini- und Mikrocomputer.",
                        "Die dritte Schicht der Netzwerkkommunikation heißt Vermittlungsschicht und nutzt das IP Protokoll (Internet Protocol) und adressiert Pakete zum Ende-zu-Ende-Transport in andere Netzwerke.",
                        "Das Internet Protokoll (IP) ist für die Weitervermittlung von Paketen und die Wegwahl (Routing) zuständig. Das Internetprotokoll existiert in der Version 4 oder 6 und besteht aus einem Netzanteil und einem Hostanteil. Der Netzanteil identifiziert ein Teilnetz, der Hostanteil identifiziert ein Gerät (Host) innerhalb eines Teilnetzes. Das IP ist nach dem OSI-Referenzmodell in der Vermittlungsschicht angesiedelt.",
                        "Die IPv6-Adressen verwenden 128 Bit zur Speicherung von Adressen und werden hexadezimal dargestellt. Um die Darstellung weiter zu vereinfachen, werden jeweils zwei Oktette der Adresse zusammengefasst und in Gruppen durch ein Doppelpunkt getrennt dargestellt. Zur weiteren Verkürzung können Nullen am Beginn eines Blocks weggelassen werden. Ein oder mehrereaufeinander folgende Blöcke, die nur aus Nullen bestehen, können durch :: ersetzt werden - jedoch höchstens einmal in der Adresse, so dass eindeutig auf acht Blöcke aufgefüllt werden kann.",
                        "Die Netzmaske oder Subnetzmaske ist eine Bitmaske die Bestandteil der IPv4 und IPv6 Netzwerkprotokolle ist. Sie gibt an welche Bit-Position innerhalb der IP-Adresse für die Adressierung des Netz- und Host-Anteils genutzt werden soll. Der Netzanteil einer IPv4 oder IPv6-Adresse kann mit einer Präfixlänge definiert werden. Das ist für die Adressierung des Netzanteils genutzte Bereich innerhalb der IP-Adresse. Daraus lässt sich auch errechnen wie groß der Geräteteil bzw Hostanteil der IP-Adresse ist. Da eine IPv4 Adresse immer eine 4 Oktetten lange Bitfolge und eine IPv6 eine 8 Oktetten lange Bitfolge besitzt. Die Präfixlänge in einer Netzmaske kann man auch als Größenangabe eines IP-Netzes verstehen, wobei größere Präfixlängen kleinere Netze bedeuten, da nicht so viele Bits für Geräteteile zur Verfügung stehen.",
                        "IPv4 (Internet Protocol Version 4) war die ersteVersion des Internet Protokolls und bildet eine wichtige technische Grundlage des Internets. Es benutzt32-Bit Adressen und kann in einem Rechnernetz etwas über 4Mrd und 200 Tausend Adressen vergeben. IPv4-Adressen werden üblicherweise dezimal in vier Blöcken geschrieben. Jedes Oktett repräsentiert 8 Bit. Eine Ipv4-Adresse besteht aus einem Netzanteil, das ein Teilnetz identifiziert und einem Hostanteil, das ein Gerät (Host) innerhalb eines Teilnetzes identifiziert deren genaue Aufteilung durch eine Subnetzmaske festgelegt wird.",
                        "DNS steht für Domain Name System und die Aufgabe dieses Systems ist die Beantwortung von Anfragen zur Namensauflösung in IP-basierten Netzwerken. Hauptsächlich wird das DNS zur Umsetzung von Domainnamen in IP-Adressen (forward lookup) benutzt.",
                        "Eine Link Local Adresse ist eine Netzwerkadresse und wird für die lokale Kommunikation innerhalb des Netzwerksegments gebraucht. Die MAC-Adresse (Media-Access-Control-Adress, auch Media Access Code) ist die Nummer eines Gerätes auf einer Datenverbindung und dient als eindeutiger Indentifikator des Geräts in einem Rechnernetz.",
                        "NDP steht für Neighbor Discovery Protocol und wird dafür benutzt IPv6-Adressen in Link-Layer-Adressen aufzulösen, damit der sendende Rechner weiß, wohin er sein Paket zu schicken hat. Diese Link-Layer-Adressen dienen der Host-zu-Host-Übertragung in lokalen Netzwerken. NDP ist zwischen der Sicherungsschicht und bedient sich bei der ÜBertragung eine Neighbor Cache in dem er die Ergebnisse der Link-Layer-Adressauflösungen zwischenspeichert.",
                        "Sie heißt Transportschicht und die genutzte Spezifikation sind das TCP und UDP Verfahren zur Netzwerkkommunikation.",
                        "Switch bedeutet Schalter oder auch Verteiler genannt. Es sorgt innerhalb eines lokalen Netwerks dafür dass die Datenpakete bzw Frames an ihr Ziel kommen. Switches arbeiten nach dem OSI-Referenzmodell auf Ebene 2-4. Ein Hub dagegen arbeitet ausschließlich auf Ebene 1 des OSI-Modells. Wenn ein Datenpaket an einem der Ports vom Hub trifft, so leitet er das Paket an alle Teilnehmer in einem lokalen Netzwerk weiter. Ein Hub fungiert als gemeinsamer Verbindungspunkt für Geräte in einem Netzwerk und ist keine Weiche wie der Switch."
                    ]
                },
                "Strukturierte Verkabelung": {
                    "fragen": [
                        "Wie funktioniert die Broadcast-Topologie?",
                        "In welcher Technik wird die Broadcast-Topologie benutzt?",
                        "Wie funktioniert die Token-Zugriff-Topologie?",
                        "In welcher Technik wird die Token-Zugriff-Topologie benutzt?",
                        "Welches Zugriffsverfahren nutz FDDI (Fiber Distributed Data Interface)?",
                        "Welches Zugriffsverfahren nutzt Token Ring?",
                        "Was ist die physikalische Topologie?",
                        "Was ist die logische Topologie?",
                        "Welche Aufgabe hat die logische Topologie?",
                        "Welche zwei wesentliche Arten von logischen Toplogien werden unterschieden?"
                    ],
                    "antworten": [
                        "Broadcast bedeutet dass jeder Host seine Daten an alle anderen Hosts im Netzwerkmedium sendet ohne feste Reihenfolge. Jeder Empfänger eines Broadcasts entscheidet selbst, ober im Falle seiner Zuständigkeit die erhaltene Nachricht entweder verarbeitet oder stillschweigend verwirft.",
                        "Es wird z.B. beim Rundfunk (UKW/DAB) oder Fernsehen (Satellit, Kabel, Funk) verwendet.",
                        "Es wird eine Art elektronischer Gutschein (Token) nacheinander an jeden Host übertragen. Mit diesem Token erhält der Host die Genehmigung, Daten über das Netz zu senden. Wenn der Host keine Daten zu versenden hat, leitet er die Erlaubnis an den nächsten Host weiter und der Vorgang wiederholt sich.",
                        "Die Token-Zugriff-Topologie ist eine Datenübertragungsverfahren, das bei Token-Ring-Netzwerken angewendet wird.",
                        "Token-Zugriff-Verfahren",
                        "Token-Zugriff-Verfahren",
                        "Die physikalische Topologie ist der eigentliche Verkabelungsplan der Medien.",
                        "Bei der logischen Topologie wird der Zugriff auf die Medien durch die Hosts definiert.",
                        "Die logische Topologie eines Netzes bestimmt, wie die Hosts über das Medium kommunizieren.",
                        "Broadcasttopologie und Zugriff-Token-Topologie"
                    ]
                }
            }
        },
        "Elektronik": {
            "thema": {
                "Kabel": {
                    "fragen": [
                        "Wie ist das UTP (Unshielded Twisted Pair) Kabel aufgebaut?",
                        "Warum ist das UTP-Kabel so aufgebaut?",
                        "Was sind EMI- und RFI- Signale?",
                        "Wie ist das STP (Shielded Twisted Pair) Kabel aufgebaut?",
                        "Warum ist das STP-Kabel so aufgebaut?",
                        "Wie ist das Koaxial Netzwerkkabel aufgebaut?",
                        "Wo wird UTP-Kabel eingesetzt?",
                        "Wo wird STP-Kabel eingesetzt?",
                        "Wo wird Koaxialkabel eingesetzt?",
                        "Warum ist eine Normung (zB TIA/EI568A/B) gut?"
                    ],
                    "antworten": [
                        "Es ist ein Kabel ohne Abschirmung (ungeschirmt), ausschließlich mit vier verdrillten Adernpaaren (Twisted Pair, TP).",
                        "Das UTP-Kabel zeichnet sich durch seine Flexibilität und geringen Kosten aus. Um dabei ein gewissen Schutz gegen Störanfälligkeit zu gewinnen sind die Adernpaare verdrillt und somit entsteht ein elektromagnetisches Feld das gleichzeitig jedes Störsignal von außerhalb löscht.",
                        "EMI-Signale sind elektromagnetische Störungen. RFI-Signale sind Hochfrequenzstörungen.",
                        "Bei dem STP-Kabel handelt es sich um ein symmetrisches Kabel mit paarig verdrillten und geschirmten Adern. Die Standardausführung von STP-Kabeln sind zwei und vierpaarig. Als Gesamtschirmung des Adernbündels wird eine Geflechtschirmung verwendet. Als Schirmung der Adernpaare dient in aller Regel ein Folienschirm oder Drahtgeflecht oder beides.",
                        "Die Abschirmung des Adernbündels und die Schirmung der Adernpaare selbst bietet einen noch besseren SChutz von Störungen als UTP-Kabel.",
                        "Ein Koaxialkabel ist konzentrisch aufgebaut und hat keine verdrillten Adernpaare. Im Innern befindet sich eine einzelne starre Kupferader oder Litze. Dieser Innenleiter wird auch Seele genannt. Darüber kommt eine ISolation oder auch Dielektrikum genannt. Es ist eine schwach- oder nichtleitende Substanz die den Innenleiter vom Außenleiter trennt. Darüber befindet sich ein Schirmgeflecht als Außenleiter. Ein Außenschutzmantel schützt das Kabel vor äußeren Umwelteinflüssen.",
                        "UTP-Kabel sind wegen ihres geringen Außendurchmessers und der fehlenden Schirme einfach zu verarbeiten und zu installieren. Sie werden in lokalen Netzwerken bei hoher Packungsdichte gerne verbaut und sind preisgünstiger als STP-Kabel.",
                        "STP-Kabel unterstützen höhere Übertragungsraten über größere Entfernungen. STP-Kabel werden häufig in firmeninternen Netzwerken verlegt und verbinden die Endgeräte als Ethernet-Kabel.",
                        "In der NEtzwerktechnik spielen Koaxialkabel keine große Rolle mehr. Bis in die 1990er Jahre wurden Koaxkabel auch für Ethernet Netzwerke verwendet. Koaxkabel werden noch zur Übertragung hochfrequenter unsymetrischer Signale eingesetzt wie bei Anbietern von Kabelfernsehen. Eine Sonderanwendung haben Koaxkabel in der Radartechnik.",
                        "EIA/TIA-568A und EIA/TIA-568B sind Standards für die Kontaktierung von achtpoligen RJ-45 Steckern und Buchsen. Es dient auch zur Festlegung der Paarung und Farbe. Es kann passieren dass ein Adernpaar falsch verdrahtet wird wenn zB zwei Adern verschiedener Paare als ein Adernpaar verwendet werden, es entstehen dann Fehler im Computernetz. Das soll die Normung verhindern. Durch die Festlegung der Farbzuordnungen nach der Normung kann man die Zugehörigkeit der Kabel zu den RJ-45 Steckern oder Buchsen zurodnen."
                    ]
                }
            }
        },
        "Software-Development": {
            "thema": {
                "Schutzbedarfanalyse": {
                    "fragen": [
                        "Was ist Informationssicherheit?",
                        "Was ist Vertraulichkeit?",
                        "Was ist Integrität?",
                        "Was ist Verfügbarkeit?",
                        "Was ist der Unterschied zwischen Datenschutz und Datensicherheit?",
                        "Was ist das IT-Grundschutzkompendium?",
                        "Was ist der Erlaubnisvorbehalt?",
                        "Was ist die Zweckbindung?",
                        "Was ist die Datenminimierung?",
                        "Was ist die Richtigkeit?",
                        "Was ist die Speicherbegrenzung?",
                        "Was ist die Integrität und Vertraulichkeit in Bezug auf die Datenschutzrechtlichen Prinzipien?",
                        "Was ist die Rechenschaftspflicht?"
                    ],
                    "antworten": [
                        "Es beschäftigt sich mit dem Schutz von Informationen. Die Aufgaben der Informationssicherheit ist es die Aufrechterhaltung der Vertraulichkeit, Integrität und Verfügbarkeit.",
                        "Bei der Vertraulichkeit geht es darum, die Informationen bzw Daten vor unzulässigem Lesezugriff zu schützen.",
                        "Die Integrität der Informationen bzw Daten meint ihre Unversertheit. Es gilt die Daten vor böswilliger oder versehentlicher Veränderung oder Löschung zu schützen.",
                        "Informationen bzw Daten sind verfügbar, wenn sie für den dafür vorgesehenen Personenkreis gelesen und geschrieben werden können.",
                        "Beim Datenschutz geht es um den Schutz personenbezogener Daten und unter welchen Vorraussetzungen personenbezogene Daten erhoben, verarbeitet oder genutzt werden dürfen. Die Datensicherheit befasst sich mit dem generellen Schutz von Daten. Darunter fallen nicht nur personenbezogene Daten sondern auch sämtliche Daten eines Unternehmens. Bei der Datensicherheit geht es auch nicht darum ob Daten verarbeitet oder erhoben werden dürfen wie beim Datenschutz sondern welche Schutzmaßnahmen für die Sicherheit der Daten ergriffen werden müssen.",
                        "Es bietet eine Möglichkeit Informationssicherheit mithilfe eines standardisierten Vorgehens umzusetzen. Bausteine spielen im Kompendium eine wesentliche Rolle. Es wird zwischen Prozessbausteinen und Systembausteinen unterschieden. Die beiden Bausteingruppen werden in weitere Schichten unterteilt.",
                        "Die Verarbeitung von personenbezogenen Daten ist grundsätzlich verboten. Es existieren aber Ausnahmen von diesem Grundsatz. Sofern: Es eine Belehrung stattfand, die Daten bereits öffentlich zugänglich sind oder die Daten gemäß einer gesetzlichen Ermächtigung erhoben werden.",
                        "Die Verarbeitung von personenbezogenen Daten ist grundsätzlich nur zu dem Zweck zulässig, zu dem diese auch erhoben wurden.",
                        "Der Umfang der Daten muss dem Zweck angemessen und erbeblich sowie auf das für die Zwecke der Verarbeitung notwendige Maß beschränkt sein (Verbot unnötiger Vorratsdatenhaltung oder Vermeidung des Personenbezugs).",
                        "Die Daten müssen sachlich richtig und erforderlichenfalls auf dem neuesten Stand sein.",
                        "Die Daten müssen in einer Form gespeichert werden, die die Identifizierung der betroffenen Personen nur so lange ermöglicht, wie es für die Zwecke, für die sie verarbeitet werden, erforderlich ist.",
                        " Die Daten müsse in einer Weise verarbeitet werden, die eine angemessene Sicherheit der personenbezogenen Daten gewährleistet.",
                        "Der Verantwortliche ist für die Einhaltung der Grundsätze verantwortlich und muss dessen Einhaltung nachweisen können."
                    ]
                }
            }
        }
    },
    "log": [
        "[Datum: 2022-03-20 \tDauer: 00:01:08 \tErfolgsquote: 50% \tFach: Wirtschaft \tThema: Ökoprinzip]",
        "[Datum: 2022-03-21 \tDauer: 00:50:08 \tErfolgsquote: 100% \tFach: Informatik \tThema: Wireless Lan]",
        "[Datum: 2022-03-23 \tDauer: 01:11:59 \tErfolgsquote: 90% \tFach: Elektronik \tThema: Kabel]",
        "[Datum: 2022-03-24 \tDauer: 02:54:27 \tErfolgsquote: 52% \tFach: Informatik \tThema: Netzwerkprotokolle]",
        "[Datum: 2022-03-24 \tDauer: 00:24:09 \tErfolgsquote: 53% \tFach: Software-Development \tThema: Schutzbedarfanalyse]"
    ]
}